[
  {
    "id": "pg5kOUJP",
    "URL": "https://arxiv.org/abs/1712.08048",
    "number": "1712.08048",
    "title": "Variable selection for Gaussian processes via sensitivity analysis of the posterior predictive distribution",
    "issued": {
      "date-parts": [
        [
          2019,
          4,
          24
        ]
      ]
    },
    "author": [
      {
        "given": "Topi",
        "family": "Paananen"
      },
      {
        "given": "Juho",
        "family": "Piironen"
      },
      {
        "given": "Michael Riis",
        "family": "Andersen"
      },
      {
        "given": "Aki",
        "family": "Vehtari"
      }
    ],
    "container-title": "arXiv",
    "publisher": "arXiv",
    "type": "report",
    "abstract": "  Variable selection for Gaussian process models is often done using automatic relevance determination, which uses the inverse length-scale parameter of each input variable as a proxy for variable relevance. This implicitly determined relevance has several drawbacks that prevent the selection of optimal input variables in terms of predictive performance. To improve on this, we propose two novel variable selection methods for Gaussian process models that utilize the predictions of a full model in the vicinity of the training points and thereby rank the variables based on their predictive relevance. Our empirical results on synthetic and real world data sets demonstrate improved variable selection compared to automatic relevance determination in terms of variability and predictive performance. ",
    "note": "license: http://arxiv.org/licenses/nonexclusive-distrib/1.0/\nThis CSL Item was generated by Manubot v0.5.1 from its persistent identifier (standard_id).\nstandard_id: arxiv:1712.08048"
  },
  {
    "title": "A tensor higher-order singular value decomposition for integrative analysis of DNA microarray data from different studies.",
    "volume": "104",
    "issue": "47",
    "page": "18371-6",
    "container-title": "Proceedings of the National Academy of Sciences of the United States of America",
    "container-title-short": "Proc Natl Acad Sci U S A",
    "ISSN": "1091-6490",
    "issued": {
      "date-parts": [
        [
          2007,
          11,
          14
        ]
      ]
    },
    "author": [
      {
        "given": "Larsson",
        "family": "Omberg"
      },
      {
        "given": "Gene H",
        "family": "Golub"
      },
      {
        "given": "Orly",
        "family": "Alter"
      }
    ],
    "PMID": "18003902",
    "PMCID": "PMC2147680",
    "DOI": "10.1073/pnas.0709146104",
    "abstract": "We describe the use of a higher-order singular value decomposition (HOSVD) in transforming a data tensor of genes x \"x-settings,\" that is, different settings of the experimental variable x x \"y-settings,\" which tabulates DNA microarray data from different studies, to a \"core tensor\" of \"eigenarrays\" x \"x-eigengenes\" x \"y-eigengenes.\" Reformulating this multilinear HOSVD such that it decomposes the data tensor into a linear superposition of all outer products of an eigenarray, an x- and a y-eigengene, that is, rank-1 \"subtensors,\" we define the significance of each subtensor in terms of the fraction of the overall information in the data tensor that it captures. We illustrate this HOSVD with an integration of genome-scale mRNA expression data from three yeast cell cycle time courses, two of which are under exposure to either hydrogen peroxide or menadione. We find that significant subtensors represent independent biological programs or experimental phenomena. The picture that emerges suggests that the conserved genes YKU70, MRE11, AIF1, and ZWF1, and the processes of retrotransposition, apoptosis, and the oxidative pentose phosphate pathway that these genes are involved in, may play significant, yet previously unrecognized, roles in the differential effects of hydrogen peroxide and menadione on cell cycle progression. A genome-scale correlation between DNA replication initiation and RNA transcription, which is equivalent to a recently discovered correlation and might be due to a previously unknown mechanism of regulation, is independently uncovered.",
    "URL": "https://www.ncbi.nlm.nih.gov/pubmed/18003902",
    "type": "article-journal",
    "id": "oqRObRv8",
    "note": "This CSL Item was generated by Manubot v0.5.1 from its persistent identifier (standard_id).\nstandard_id: pubmed:18003902"
  },
  {
    "title": "S3CMTF: Fast, accurate, and scalable method for incomplete coupled matrix-tensor factorization.",
    "volume": "14",
    "issue": "6",
    "page": "e0217316",
    "container-title": "PloS one",
    "container-title-short": "PLoS One",
    "ISSN": "1932-6203",
    "issued": {
      "date-parts": [
        [
          2019,
          6,
          28
        ]
      ]
    },
    "author": [
      {
        "given": "Dongjin",
        "family": "Choi"
      },
      {
        "given": "Jun-Gi",
        "family": "Jang"
      },
      {
        "given": "U",
        "family": "Kang"
      }
    ],
    "PMID": "31251750",
    "PMCID": "PMC6599158",
    "DOI": "10.1371/journal.pone.0217316",
    "abstract": "How can we extract hidden relations from a tensor and a matrix data simultaneously in a fast, accurate, and scalable way? Coupled matrix-tensor factorization (CMTF) is an important tool for this purpose. Designing an accurate and efficient CMTF method has become more crucial as the size and dimension of real-world data are growing explosively. However, existing methods for CMTF suffer from lack of accuracy, slow running time, and limited scalability. In this paper, we propose S3CMTF, a fast, accurate, and scalable CMTF method. In contrast to previous methods which do not handle large sparse tensors and are not parallelizable, S3CMTF provides parallel sparse CMTF by carefully deriving gradient update rules. S3CMTF asynchronously updates partial gradients without expensive locking. We show that our method is guaranteed to converge to a quality solution theoretically and empirically. S3CMTF further boosts the performance by carefully storing intermediate computation and reusing them. We theoretically and empirically show that S3CMTF is the fastest, outperforming existing methods. Experimental results show that S3CMTF is up to 930× faster than existing methods while providing the best accuracy. S3CMTF shows linear scalability on the number of data entries and the number of cores. In addition, we apply S3CMTF to Yelp rating tensor data coupled with 3 additional matrices to discover interesting patterns.",
    "URL": "https://www.ncbi.nlm.nih.gov/pubmed/31251750",
    "type": "article-journal",
    "id": "5XL7PCnt",
    "note": "This CSL Item was generated by Manubot v0.5.1 from its persistent identifier (standard_id).\nstandard_id: pubmed:31251750"
  }
]
